tutorials/compressible/rhoSimpleFoam/gasMixing/injectorPipe/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoSimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.4;

deltaT          1e-04;

writeControl    adjustableRunTime;

writeInterval   2e-3;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;


// SIMPLE
endTime         1200;
deltaT          1;
writeInterval   100;

#include "sampleControls"

functions
{
    #include "abort"
    #include "scalarTransport"
    #include "sampling"
}

OptimisationSwitches
{
    // Force dumping (at next timestep) upon signal: 12 = USR2
    writeNowSignal  12;
}

// ************************************************************************* //
